/****************************************Copyright (c)************************************************************
**                              
**                          深圳市生基科技有限公司       
**                                  
**--------------文件信息------------------------------------------------------------------------------------------
**文   件   名: UserComm.h
**创   建   人: 杨承凯
**创 建 日  期: 2008年09月17日
**最后修改日期: 2008年09月17日
**描        述: 通信应用层头文件
*****************************************************************************************************************/
#ifndef 	_USERCOMM_H_
#define 	_USERCOMM_H_

#ifdef		_USERCOMM_C_
#define		USERCOMM_EXT
#else
#define		USERCOMM_EXT		extern
#endif
//****************************************************************************************************************

//函数使能
#define		_USERCOMM_INIT_EN_
//#define		_DATA_STORE_PRO_





/****************************************************************************
* 名	称：UserCommInit(void)
* 功	能：初始化
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void UserCommInit(void) reentrant;

/****************************************************************************
* 名	称：HostCommProcess(void)
* 功	能：上层通信事务处理
* 入口参数：nLen，数据包长度
* 出口参数：是否成功
* 说	明：无
****************************************************************************/ 
BOOL HostCommProcess(uint8 nLen) reentrant;

/****************************************************************************
* 名	称：SensorProcess(void)
* 功	能：传感器事务处理
* 入口参数：无
* 出口参数：是否成功
* 说	明：无
****************************************************************************/ 
BOOL DataAcqProcess(void) reentrant;

/****************************************************************************
* 名	称：MemProcess(void)
* 功	能：存储事务处理
* 入口参数：无
* 出口参数：是否成功
* 说	明：无
****************************************************************************/ 
void DataStoreProcess(void) reentrant;

/****************************************************************************
* 名	称：SetNormalRecvTimeOut(void)
* 功	能：设置正常状态时通信接收超时时间
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void SetNormalRecvTimeOut(void) reentrant;

/****************************************************************************
* 名	称：SetSleepRecvTimeOut(void)
* 功	能：设置休眠时通信接收超时时间
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void SetSleepRecvTimeOut(void) reentrant;

/****************************************************************************
* 名	称：SetFreqToDefault(void)
* 功	能：设置频率为默认频率
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void SetFreqToDefault(void) reentrant;

/****************************************************************************
* 名	称：SetFreqToCur(void)
* 功	能：设置频率为调频频率
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void SetFreqToCur(void) reentrant;

/****************************************************************************
* 名	称：CommDataClear(void)
* 功	能：清除通信数据
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void CommDataClear(void) reentrant;

/****************************************************************************
* 名	称：PostDataStore(void)
* 功	能：发送数据存储信号
* 入口参数：nChannelID，通道号
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void PostDataStore(uint8 nEp) reentrant;


/****************************************************************************
* 名	称：SensorDetectionAndShow(void)
* 功	能：传感器检测
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 
void SensorDetectionAndShow(void) reentrant;

/****************************************************************************
* 名	称：UserCommInit(void)
* 功	能：初始化
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/ 

void CommProcess(void);



#endif
