/****************************************Copyright (c)************************************************************
**                              
**                                 
**                                  
**--------------文件信息------------------------------------------------------------------------------------------
**文   件   名: PowerManager.h
**创   建   人: 杨承凯
**创 建 日  期: 2011年04月05日
**最后修改日期: 2011年04月05日
**描        述: 电源管理头文件
*****************************************************************************************************************/
#ifndef _POWER_MANAGER_H_
#define _POWER_MANAGER_H_


//电压管理初始化
void PowerManagerInit(void);		

//设置电压范围
void SetPowerRange(float fLo, float fHi);

//获取电压百分比余量
int8 GetPowerRate(void);

//是否低电压
BOOL IsLowPower(void);

//电压管理
void PowerManagerProcess(void);	

//设备自检
void PowerTest(void);

#endif
