/************************************************************************************
**																			 
**																			 
**																			 
**--------文 件 信 息----------------------------------------------------------------
**文   件   名：														 
**创   建   人：															 
**创 建  时 间：2008.4.7													 
**最后修改时间：															      
**描        述：
************************************************************************************/

#define _AD_C_

//-----------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------
#include "..\BSP\bsp.h"

/******************************************************************************
**名	称：GetADValue()																 
**功	能：AD初始化																 
**入口参数：无														 
**出口参数：无															 
**说	明：无															 
******************************************************************************/
#ifdef _ADC_INIT_
void ADC_Init() reentrant
{
    AMX0P     = 0x13;					// 正端选择电流检测
	AMX0N     = 0x1F;					// 负端选地
	P1SKIP	 |= 0x06;					// 交叉开关跳过
	P1MDIN	 &= ~0x06;					// 模拟输入
    REF0CN    = 0x03;					// 参考电压为内部基准电压，2.44V
    ADC0CN    = 0x80;					// 使能AD
}
#endif
/******************************************************************************
**名	称：GetADValue()																 
**功	能：启动AD，获得采样的AD值																 
**入口参数：无														 
**出口参数：2个字节的AD值
**说	明：无															 
******************************************************************************/
#ifdef _GET_AD_VALUE_
unsigned int GetADValue(void) reentrant
{
	unsigned int nADValue = 0;

	//--------启动ADC0---------------------------------------------------------
	while(AD0BUSY);
	AD0BUSY = 1;

	while(!AD0INT);		//等待转换完毕
	OSTimeDly(1);
									
	nADValue += ADC0H;
	nADValue = nADValue << 8;
	nADValue += ADC0L;

	return nADValue;
}
#endif

/******************************************************************************
**名	称：GetPowerCurrent()																 
**功	能：计算送到目标板的电流值																 
**入口参数：无														 
**出口参数：电流值
**说	明：无															 
******************************************************************************/
#ifdef _GET_POWER_CURRENT_
float GetPowerCurrent(void) reentrant
{
	unsigned int nAD;
	float fCurr = 0;
	AMX0P     = 0x13;						// 转换AD到电流检测功能
	nAD = GetADValue();
	fCurr = (float)nAD / 1023 * 2.44 * 11 + 0.283;

	return fCurr;
}
#endif
/******************************************************************************
**名	称：GetRFPower()																 
**功	能：计算送到目标板的电流值																 
**入口参数：无														 
**出口参数：电流值
**说	明：无															 
******************************************************************************/
#ifdef _GET_RF_POWER_
float GetRFPower(void) reentrant 
{
	unsigned int nAD;
	float fCurr = 0;
	float fPower = 0;
	AMX0P     = 0x14;						// 转换AD到功率检测功能
	nAD = GetADValue();
	fCurr = (float)nAD / 1023 * 2.44;
	fPower = (fCurr - 0.500)*1000 / 16.8 - 65;//18.62 - 65;

	return fPower/1000;
}
#endif

/******************************************************************************
**名	称：GetRFPower()																 
**功	能：计算送到目标板的电流值																 
**入口参数：无														 
**出口参数：电流值
**说	明：无															 
******************************************************************************/
#ifdef _FTOA_
void ftoa(float f, INT8U *dat) reentrant
{
	INT32U x1, x2;
	float f1 = f;
	if(f1<0)
	{
		f1 = 0 - f1;
	}
	x2 = (INT32U)(f1);
	x1 = (INT32U)((f1 - x2)*10000);
	if(f<0)	
	{
	 	dat[0] = '-';
	}
	else
	{
		dat[0] = (INT8U)(x2 /100 % 10) + 0x30;
	}
	dat[1] = (INT8U)(x2 / 10 % 10) + 0x30;
	dat[2] = (INT8U)(x2 % 10) + 0x30;
	dat[3] = '.';
	dat[4] = (INT8U)(x1 / 1000 % 10) + 0x30;
	dat[5] = (INT8U)(x1 / 100 % 10) + 0x30;	
	dat[6] = (INT8U)(x1 / 10 % 10) + 0x30;	
	dat[7] = (INT8U)(x1 % 10) + 0x30;	


}
#endif
