/****************************************Copyright (c)************************************************************
**                              
**                                 
**                                  
**--------------文件信息------------------------------------------------------------------------------------------
**文   件   名: Lights.c
**创   建   人: 杨承凯
**创 建 日  期: 2008年9月17日
**最后修改日期: 2008年9月17日
**描        述: 零散的函数
*****************************************************************************************************************/
#define 	_LIGHTS_C_

//includes--------------------------------------------------------------------------------------------------------
#include "includes.h"
#include "..\user\PowerManager.h"

//编译控制
#define USE_LED

//signal defines--------------------------------------------------------------------------------------------------

//****************************************************************************************************************
static OS_EVENT 	*pLightsEvent;						    	//事件控制块
static uint8 		nLightsErr;									//错误标志
static uint8 		bLightSignleLED = 0;						//错误标志
static uint16		nLightsTicksSpan;							//指示灯索引

//端口设定 
#define	LED_PORT			GPIOF	   
#define	LED					11

#define	POWER_LED_PORT		GPIOB	   
#define	POWER_LED			5


//指示灯控制，0表示低电平控制灯亮
#define	LED_ON		0

/****************************************************************************
* 名	称：SigLightOn()
* 功	能：信号灯点亮
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void SigLightOn() reentrant
{
#if (LED_ON == 0)
	SetLo(LED);
#endif
}

/****************************************************************************
* 名	称：SigLightOff()
* 功	能：信号灯熄灭
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void SigLightOff() reentrant
{
#if (LED_ON == 0)	
	SetHi(LED);
#endif
}

/****************************************************************************
* 名	称：PowerLightOn()
* 功	能：电源灯点亮
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void PowerLightOn(void) reentrant
{
	SetLo(POWER_LED);
}

/****************************************************************************
* 名	称：PowerLightOff()
* 功	能：电源灯熄灭
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void PowerLightOff(void) reentrant
{
	SetHi(POWER_LED);
}

/****************************************************************************
* 名	称：LightsInit()
* 功	能：指示灯初始化
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void LightsInit() reentrant
{
	//指示灯
	SetHi(LED);
	SetHi(POWER_LED);
	MakeOpenDrain(LED);
	MakeOpenDrain(POWER_LED);
	
	//MakePushPull(LED);
	//创建信号量
	pLightsEvent = OSSemCreate(0);
}

/****************************************************************************
* 名	称：PostLightOn()
* 功	能：指示灯点量信号
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void PostLightOn(uint16 nTicksSpan) reentrant
{
	if(LED_ON == GetSignal(LED)) return;   

	nLightsTicksSpan = nTicksSpan;
	bLightSignleLED = TRUE;
	OSSemPost(pLightsEvent);
}


/****************************************************************************
* 名	称：LightsProcess()
* 功	能：指示灯处理
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void LightsProcess() reentrant
{
	OSSemPend(pLightsEvent, 100, &nLightsErr);

	if(	bLightSignleLED == TRUE)
	{
		SigLightOn();
		bLightSignleLED = FALSE;
		OSTimeDly(nLightsTicksSpan);
		SigLightOff(); 
	}
	else
	{
//		if(IsLowPower() != TRUE)
		{
			PowerLightOn();
			OSTimeDly(10);
			PowerLightOff(); 
		}
	}
}














