/****************************************文件信息**************************************************                      
**
**文   件   名: LCDDisp.h
**创   建   人: 黄安源
**创 建 日  期: 2007年7月18日
**最后修改日期: 2007年8月 1日
**描        述: LCD显示头文件

**改		编: 杨承凯
**改 编  日 期: 2008年4月4日
***************************************************************************************************/
#ifndef 	_LCDDisp_H_
#define 	_LCDDisp_H_


#ifdef		_LCDDisp_C_
#define		LCDDisp_EXT
#else
#define		LCDDisp_EXT		extern
#endif

//依赖的头文件
#include "LCDDriver.h"

//编译控制  -----------------------------------------------------------
#define  GRAPH_INIT
//#define  LOCATEXY
//#define  DISP_POINT
//#define  HORI_LINE
//#define  VERT_LINE
//#define  SKEW_LINE
//#define  CIRCLE

#define  LCDDISP_STRING
//#define  DISP_LINE
//#define  DISP_RECT
//#define  DISP_CIRC
//#define  DISP_BITMAP


//数据结构定义------------------------------------------------------

//LCD坐标定义---------------------------------------------------------
#define    XLabel       INT8U
#define    YLabel       INT8U


//像素点坐标定义----------------------------------------------------
typedef struct 
{
	XLabel   x;     //像素点x坐标
	YLabel   y;		//像素点y坐标			
} Point;


//直线结构定义-------------------------------------------------------
typedef struct 
{
	Point     Start;	//直线起点坐标
	Point     End;		//直线终点坐标
	INT8U	  Width;    //直线宽度
} Line;

//矩形结构定义-------------------------------------------------------
typedef struct 
{
	Point     Start;	//矩形起点坐标
	Point     End;		//矩形终点坐标
	INT8U	  Width;    //矩形边框宽度
} Rect;


//圆形结构定义-------------------------------------------------------
typedef struct 
{
	Point     Centre;	//圆心坐标
    INT8U	  r;	    //半径	
	INT8U	  Width;	//圆周宽度
} Circ;


typedef struct tagBITMAP 
{
    INT8U   bmWidth;        //位图宽度
    INT8U   bmHeight;       //位图高度
    INT16U *bmBits;         //位图显示的数据 
} BITMAP, *PBITMAP; 


//函数声明--------------------------------------------------------------

/****************************************************************************
* 名	称：DispStr()
* 功	能：显示字符串函数
* 入口参数：pstr 待显示的字符串数据，以空字符结束(0x00)
* 出口参数：无
* 说	明：包括中文和ASCII码;
****************************************************************************/
LCDDisp_EXT void DispStr(INT8U nAddr,INT8U *pstr) reentrant;


/****************************************************************************
* 名	称：GraphInit()
* 功	能：图形显示初始化
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDisp_EXT void GraphInit() reentrant;


/****************************************************************************
* 名	称：GraphClear()
* 功	能：图形清屏函数
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDisp_EXT void GraphClear() reentrant;

/****************************************************************************
* 名	称：LocateXY()
* 功	能：设定当前坐标
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void LocateXY(XLabel ParaX, YLabel ParaY) reentrant;

/****************************************************************************
* 名	称：DispPoint()
* 功	能：显示点
* 入口参数：无
* 出口参数：无
* 说	明：显示全局变量CurrentPoint的像素点
****************************************************************************/
LCDDisp_EXT void DispPoint(XLabel x, YLabel y) reentrant;

/****************************************************************************
* 名	称：HoriLine()
* 功	能：显示水平直线函数
* 入口参数：length 待显示水平直线的长度
* 出口参数：无
* 说	明：以当前坐标为起点 宽度为1个像素 
****************************************************************************/
LCDDisp_EXT void HoriLine(XLabel ParaX, YLabel ParaY, INT8U length) reentrant;

/****************************************************************************
* 名	称：VertLine()
* 功	能：显示垂直直线函数
* 入口参数：length 待显示垂直直线的长度
* 出口参数：无
* 说	明：以当前坐标为起点 宽度为1个像素
****************************************************************************/
LCDDisp_EXT void VertLine(XLabel ParaX, YLabel ParaY, INT8U length) reentrant;


/****************************************************************************
* 名	称：SkewLine()
* 功	能：显示直线函数
* 入口参数：deltaX x方向上的坐标差  deltaY y方向上的坐标差
* 出口参数：无
* 说	明：以当前坐标为起点 宽度为1个像素            
****************************************************************************/
LCDDisp_EXT void SkewLine(XLabel ParaX, YLabel ParaY, INT8S deltaX,INT8S deltaY) reentrant;


/****************************************************************************
*名	   称：Circle()
*功    能：显示圆函数
*入口参数：Rx 半径 
*出口参数：无
*说    明：以当前坐标为圆心 宽度为1个像素 数学方程(X-Ox)^2+(Y-Oy)^2=Rx^2     
/****************************************************************************/
LCDDisp_EXT void Circle(XLabel ParaX, YLabel ParaY, INT8U Rx) reentrant;

/****************************************************************************
* 名	称：DispLine()
* 功	能：显示直线函数
* 入口参数：pline 待显示直线的参数
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDisp_EXT void DispLine(Line pline) reentrant;

/****************************************************************************
* 名	称：DispRect()
* 功	能：显示矩形函数
* 入口参数：prect 待显示的矩形参数
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDisp_EXT void DispRect(Rect prect) reentrant;


/****************************************************************************
* 名	称：DispCirc()
* 功	能：显示圆函数
* 入口参数：pcirc 待显示的圆的参数
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDisp_EXT void DispCirc(Circ pcirc) reentrant;


/****************************************************************************
* 名	称：DispBitmap()
* 功	能：显示位图函数
* 入口参数：pbmap 待显示的位图的参数
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDisp_EXT void DispBitmap(XLabel ParaX, YLabel ParaY, BITMAP pbmap) reentrant;


//************************************************
#endif