/****************************************文件信息**************************************************                      
**
**文   件   名: LCDDriver.h
**创   建   人: 黄安源
**创 建 日  期: 2007年7月17日
**最后修改日期: 2007年7月31日
**描        述: LCD驱动头文件

**改		编: 杨承凯
**改 编  日 期: 2008年4月4日
***************************************************************************************************/
#ifndef 	_LCDDriver_H_
#define 	_LCDDriver_H_

#ifdef		_LCDDriver_C_
#define		LCDDriver_EXT
#else
#define		LCDDriver_EXT 	extern
#endif


//***************************************************************************

//编译控制
#define		LCDDRIVER_INIT
#define		LCDDRIVER_READ_STATE
#define		LCDDRIVER_IS_BUSY
//#define 	LCDDRIVER_READ_AC
#define		LCDDRIVER_WRITE_CMD
#define 	LCDDRIVER_WRITE_DATA
//#define 	LCDDRIVER_READ_DATA
#define     LCD_DELAY_NUS

//函数声明

/****************************************************************************
* 名	称：LCDDriverInit()
* 功	能：LCD端口初始化函数
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDriver_EXT void LcdDriverInit() reentrant;

/****************************************************************************
* 名	称：LcdReadState()
* 功	能：LCD读状态函数
* 入口参数：无
* 出口参数：TmpData ,读出LCD忙闲状态和地址
* 说	明：无
****************************************************************************/
LCDDriver_EXT INT8U LcdReadState() reentrant;


/****************************************************************************
* 名	称：LcdIsBusy()
* 功	能：LCD忙状态判断函数
* 入口参数：无
* 出口参数：LCD忙标志, 1:忙 0:闲
* 说	明：无
****************************************************************************/
LCDDriver_EXT BOOL LcdIsBusy() reentrant;

/****************************************************************************
* 名	称：LcdReadAC()
* 功	能：LCD读位地址计数器AC的值函数
* 入口参数：无
* 出口参数：位地址计数器AC的值
* 说	明：无
****************************************************************************/
LCDDriver_EXT  INT8U LcdReadAC() reentrant;

/****************************************************************************
* 名	称：LcdWriteCmd()
* 功	能：LCD写指令函数
* 入口参数：cmd，指令
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDriver_EXT void LcdWriteCmd(INT8U cmd) reentrant;

/****************************************************************************
* 名	称：LcdWriteData()
* 功	能：LCD写数据函数
* 入口参数：dat，数据
* 出口参数：无
* 说	明：无
****************************************************************************/
LCDDriver_EXT void LcdWriteData(INT8U dat) reentrant;

/****************************************************************************
* 名	称：LcdReadData()
* 功	能：LCD读数据函数
* 入口参数：无
* 出口参数：pData ,读出数据 nLen 数据长度
* 说	明：无
****************************************************************************/
LCDDriver_EXT void LcdReadData(INT8U* pData, INT8U nLen) reentrant;

/****************************************************************************
* 名	称：LcdDelaynus()
* 功	能：延时 n us
* 入口参数：ntime 延时的时间
* 出口参数：
* 说	明：无
****************************************************************************/
LCDDriver_EXT void LcdDelaynus(INT16U ntime) reentrant;


#endif