/****************************************Copyright (c)************************************************************
**                              
**                                 
**                                  
**--------------文件信息------------------------------------------------------------------------------------------
**文   件   名: XMem.c
**创   建   人: 杨承凯
**创 建 日  期: 2007年10月13日
**最后修改日期: 2007年10月13日
**描        述: 片外数据存储器访问源文件
*****************************************************************************************************************/
#define 	_XMEM_C_

//includes--------------------------------------------------------------------------------------------------------
#include "..\global.h"
#include "XMem.h"

//signal defines--------------------------------------------------------------------------------------------------
//#define MCU_XRAM_CS
#define KILL_CERCUIT_BUG


#ifdef  MCU_XRAM_CS
#define	XMEM_CS_PORT		PORT(1)
#define XMEM_CS				BIT(5)
#endif

#ifdef  KILL_CERCUIT_BUG
#define XMEM_BL_PORT		PORT(1)
#define XMEM_BL				BIT(4)
#endif

/*****************************************************************************************************************
* 名	称：XMemPortInit()
* 功	能：外部存储器接口初始化函数
* 入口参数：无
* 出口参数：无
* 说	明：无
*****************************************************************************************************************/
#ifdef	_XMEM_H_
void XMemPortInit() reentrant
{	
	EMI0CF = 0x0B;						//注意这里操作SRAM的等待时间要足够长才能正常运行
	EMI0TC = 0xB2;
	P3MDOUT |= 0xFF;   					//Sram_Adr8~SramAdr16端口设为输出，必需的
	P4MDOUT |= 0xFF;   					//Sram_Adr8~SramAdr16端口设为输出，必需的
	
	//Bank选择信号
	P0MDOUT |= 0x0C;   					//Sram_Adr16>>P0.3,Sram_Adr17>>P0.2端口设为输出
	P0 &= ~0x0c;						//初始化位Bank0

	P1MDOUT |= 0xC8;

	//片选信号
#ifdef  MCU_XRAM_CS
	MakePushPull(XMEM_CS);
	SetLo(XMEM_CS);
#endif

	//线路错误
#ifdef KILL_CERCUIT_BUG
	MakeOpenDrain(XMEM_BL);
	SetHi(XMEM_BL);
#endif

}
#endif

/*****************************************************************************************************************
* 名	称：XMemBankSel()
* 功	能：外部存储器Bank选择函数
* 入口参数：无
* 出口参数：无
* 说	明：无
*****************************************************************************************************************/
#ifdef	_XMEM_BANK_SEL_
void XMemBankSel(INT8U nSel) reentrant
{	
	P0 &= ~0x0C;
	P0 |= (nSel<<2);
}
#endif


//****************************************************************************************************************




