/****************************************Copyright (c)************************************************************
**                              
**                                 
**                                  
**--------------文件信息------------------------------------------------------------------------------------------
**文   件   名: Lights.c
**创   建   人: 
**创 建 日  期: 2008年9月17日
**最后修改日期: 2008年9月17日
**描        述: 零散的函数
*****************************************************************************************************************/
#define 	_LIGHTS_C_

//includes--------------------------------------------------------------------------------------------------------
#include "includes.h"
#include "CpuPortAccess.h"
#include "lights.h"

//编译控制
#define USE_LED

//signal defines--------------------------------------------------------------------------------------------------

//****************************************************************************************************************

//端口设定 
#define	LED_PORT			GPIOB	   
#define	LED					5

#define	POWER_LED_PORT		GPIOB	   
#define	POWER_LED			5


//指示灯控制，0表示低电平控制灯亮
#define	LED_ON		0

/****************************************************************************
* 名	称：SigLightOn()
* 功	能：信号灯点亮
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void SigLightOn() reentrant
{
#if (LED_ON == 0)
	SetLo(LED);
#endif
}

/****************************************************************************
* 名	称：SigLightOff()
* 功	能：信号灯熄灭
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void SigLightOff() reentrant
{
#if (LED_ON == 0)	
	SetHi(LED);
#endif
}

void SigLightToggle() reentrant
{
	static u8 flag = 0;

	if (flag)
	{
		flag = 0;
		SigLightOn();
	}
	else
	{
		flag = 1;
		SigLightOff();
	}
}

/****************************************************************************
* 名	称：PowerLightOn()
* 功	能：电源灯点亮
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void PowerLightOn(void) reentrant
{
	SetLo(POWER_LED);
}

/****************************************************************************
* 名	称：PowerLightOff()
* 功	能：电源灯熄灭
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void PowerLightOff(void) reentrant
{
	SetHi(POWER_LED);
}

/****************************************************************************
* 名	称：LightsInit()
* 功	能：指示灯初始化
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void LightsInit() reentrant
{
	//指示灯
	GPIO_InitTypeDef  GPIO_InitStructure;

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;   //复用推挽输出
	GPIO_Init(GPIOA,&GPIO_InitStructure);

	SetHi(LED);
	SetHi(POWER_LED);
	MakeOpenDrain(LED);
	MakeOpenDrain(POWER_LED);
	
	//MakePushPull(LED);
	//创建信号量
}




/****************************************************************************
* 名	称：LightsProcess()
* 功	能：指示灯处理
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void LightsProcess() reentrant
{

	{
		SigLightOn();
		SigLightOff(); 
	}
	{
//		if(IsLowPower() != TRUE)
		{
			PowerLightOn();
			PowerLightOff(); 
		}
	}
}














