/****************************************Copyright (c)**************************************************
**                              
**                                 
**                                  
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: nrf905.h
**创   建   人: 杨承凯
**最后修改日期: 2006年6月20日
**描        述: nrf905头文件
********************************************************************************************************/
#ifndef		_NRF905_H_
#define		_NRF905_H_

#ifdef		_NRF905_C_
#define		NRF905_EXT
#else
#define		NRF905_EXT	extern
#endif

//Nrf905设备控制模块定义
typedef struct 
{
	uint16 	nTransFreq;		//905频率,确保在4224--4735之间，实际将设定的频率为nFreq/10
	uint32 	LocalDNS;		//本地DNS
	uint32	RemoteDNS;		//对方DNS
	uint8	nTxLen;			//发送数据的长度
	uint8	nRxLen;			//接收数据的长度
} NRF905DCB;

//***************编译控制**********************************************

#define	_NRF905_INIT_
#define _NRF905_SET_RECV_TIME_OUT_
#define _NRF905_READ_
#define _NRF905_SEND_
#define	_NRF905_SEND_CARRY_
#define	_NRF905_RECEIVE_
#define _NRF905_CLOSE_
//#define _NRF905_SET_IS_FRESH_


//**********************函数声明*********************************************

/****************************************************************************
* 名	称：Nrf905PortInit()
* 功	能：nrf905初始化函数
* 入口参数：bOverTime 指示是否需要设置超时
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905PortInit() reentrant;


/****************************************************************************
* 名	称：Nrf905VariInit()
* 功	能：nrf905全局变量初始化函数
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905VariInit() reentrant;

/****************************************************************************
* 名	称：Nrf905SetDcb()
* 功	能：设置设备控制参数
* 入口参数：pBrfDcb：设备控制参数
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905SetDcb(NRF905DCB *pBrfDcb) reentrant;

/****************************************************************************
* 名	称：Nrf905SetRecvTimeOut()
* 功	能：设置接收超时时间
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905SetRecvTimeOut(uint16 nTimeOut) reentrant;

/****************************************************************************
* 名	称：OpenNrf905()
* 功	能：打开905通信
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void OpenNrf905() reentrant;

/****************************************************************************
* 名	称：CloseNrf905()
* 功	能：关闭905通信
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
void CloseNrf905() reentrant;


/****************************************************************************
* 名	称：nrf905_IsFresh()
* 功	能：nrf905判断信道是否空闲
* 入口参数：无
* 出口参数：指示信道是否空闲，1：空闲，2：不空闲
* 说	明：无
****************************************************************************/
NRF905_EXT BOOL Nrf905IsFresh() reentrant;


/****************************************************************************
* 名	称：nrf905_rw()
* 功	能：nrf905读写函数
* 入口参数：ctr 命令字; pd 待读写数据的指针; nd 待读写数据的长度
* 出口参数：无
* 说	明：ctr 在上文中已定义
****************************************************************************/
static void nrf905_rw(uint8 ctr, uint8 *pd, uint16 nd, uint8 bNeedRead) reentrant;

/****************************************************************************
* 名	称：Nrf905ReadData()
* 功	能：nrf905读接收数据函数
* 入口参数：pd 待读数据的指针; nd 待读数据的长度
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905ReadData(uint8 *pd,uint16 nd) reentrant;

/****************************************************************************
* 名	称：Nrf905Send()
* 功	能：nrf905发送数据函数
* 入口参数：pd 待写数据的指针; nd 待写数据的长度
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905Send(uint8 *pd,uint16 nd) reentrant;

/****************************************************************************
* 名	称：Nrf905SendCarry()
* 功	能：发送载波，供测试用
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT void Nrf905SendCarry(uint16 nCycles) reentrant;


/****************************************************************************
* 名	称：Nrf905Receive()
* 功	能：nrf905接收程序
* 入口参数：无
* 出口参数：无
* 说	明：无
****************************************************************************/
NRF905_EXT BOOL Nrf905Receive() reentrant;

//****************************************************************************
#endif