/****************************************Copyright (c)************************************************************
**                              
**                                 
**                                  
**--------------文件信息------------------------------------------------------------------------------------------
**文   件   名: Nrzi.h
**创   建   人: 杨承凯
**创 建 日  期: 2009年7月7日
**最后修改日期: 
**描        述: 反向不归零编码头文件
*****************************************************************************************************************/
#ifndef _NRZI_H_
#define _NRZI_H_

#ifdef __cplusplus
extern "C"
{
#endif

//反向不归零编码
int NrziEncode0(uint8* pIn, uint8 nIn, uint8* pOut);

//反相不归零解码
int NrziDecode0(uint8* pIn, uint8 nIn, uint8* pOut);

#ifdef __cplusplus
}
#endif

#endif
